Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/introducing-jsx_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: introducing-jsx title: Introducing JSX permalink: docs/introducing-jsx.html prev: hello-world.html next: rendering-elements.html ---
ja: --- id: introducing-jsx title: JSX の導入 permalink: docs/introducing-jsx.html prev: hello-world.html next: rendering-elements.html ---

source: Consider this variable declaration:
ja: 以下の変数宣言を考えてみましょう：

source: This funny tag syntax is neither a string nor HTML.
ja: このおかしなタグ構文は文字列でも HTML でもありません。

source: It is called JSX, and it is a syntax extension to JavaScript.
ja: これは JSX と呼ばれる JavaScript の構文の拡張です。

source: We recommend using it with React to describe what the UI should look like.
ja: UI がどのような見た目かを記述するために、React とともに JSX を使用することを私たちはお勧めしています。

source: JSX may remind you of a template language, but it comes with the full power of JavaScript.
ja: JSX はテンプレート言語を連想させるでしょうが、JavaScript の機能を全て備えたものです。

source: JSX produces React "elements".
ja: JSX は React "要素" を生成します。

source: We will explore rendering them to the DOM in the [next section](/docs/rendering-elements.html).
ja: [次の章](/docs/rendering-elements.html)で React 要素を DOM に変換する方法について見ていきます。

source: Below, you can find the basics of JSX necessary to get you started.
ja: 以下では、JSX を使い始めるのに必要な基礎を学ぶことができます。

source: ### Why JSX? {#why-jsx}
ja: ### JSXを使う理由 {#why-jsx}

source: React embraces the fact that rendering logic is inherently coupled with other UI logic: how events are handled, how the state changes over time, and how the data is prepared for display.
ja: 表示のためのロジックは、イベントへの応答や経時的な状態の変化、画面表示のためのデータを準備する方法といった、他の UI ロジックと本質的に結合したものであり、React はその事実を受け入れます。

source: Instead of artificially separating *technologies* by putting markup and logic in separate files, React [separates *concerns*](https://en.wikipedia.org/wiki/Separation_of_concerns) with loosely coupled units called "components" that contain both.
ja: マークアップとロジックを別々のファイルに書いて人為的に*技術*を分離するのではなく、React はマークアップとロジックを両方含む疎結合の「コンポーネント」という単位を用いて[*関心*を分離](https://en.wikipedia.org/wiki/Separation_of_concerns)します。

source: We will come back to components in a [further section](/docs/components-and-props.html), but if you're not yet comfortable putting markup in JS, [this talk](https://www.youtube.com/watch?v=x7cQ3mrcKaY) might convince you otherwise.
ja: [後のセクション](/docs/components-and-props.html)でコンポーネントについては改めて詳しく紹介しますが、現時点で JavaScript にマークアップを書くことが気にくわない場合、[こちらの議論](https://www.youtube.com/watch?v=x7cQ3mrcKaY)で考えが改まるかもしれません。

source: React [doesn't require](/docs/react-without-jsx.html) using JSX, but most people find it helpful as a visual aid when working with UI inside the JavaScript code.
ja: React で JSX を使うことは[必須ではありません](/docs/react-without-jsx.html)が、ほとんどの人は JavaScript コード中で UI を扱う際に、JSX を見た目に有用なものだと感じています。

source: It also allows React to show more useful error and warning messages.
ja: また、JSX があるために React は有用なエラーや警告をより多く表示することができます。

source: With that out of the way, let's get started!
ja: 前置きはこのくらいにして、早速始めましょう。

source: ### Embedding Expressions in JSX {#embedding-expressions-in-jsx}
ja: ### JSX に式を埋め込む {#embedding-expressions-in-jsx}

source: In the example below, we declare a variable called `name` and then use it inside JSX by wrapping it in curly braces:
ja: 以下の例では、`name` という変数を宣言して、それを中括弧に囲んで JSX 内で使用しています。

source: You can put any valid [JavaScript expression](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Expressions_and_Operators#Expressions) inside the curly braces in JSX.
ja: あらゆる有効な [JavaScript の式](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Expressions_and_Operators#Expressions)を JSX 内で中括弧に囲んで使用できます。

source: For example, `2 + 2`, `user.firstName`, or `formatName(user)` are all valid JavaScript expressions.
ja: 例えば、`2 + 2` や `user.firstName` や `formatName(user)` はすべて有効な JavaScript の式です。

source: In the example below, we embed the result of calling a JavaScript function, `formatName(user)`, into an `` element.
ja: 以下の例では、`formatName(user)` という JavaScript 関数の結果を `` 要素内に埋め込んでいます。

source: We split JSX over multiple lines for readability.
ja: 読みやすさのため JSX を複数行に分けています。

source: While it isn't required, when doing this, we also recommend wrapping it in parentheses to avoid the pitfalls of [automatic semicolon insertion](https://stackoverflow.com/q/2846283).
ja: 必須ではありませんが、複数行に分割する場合には、[自動セミコロン挿入](https://stackoverflow.com/q/2846283)の落とし穴にはまらないように括弧で囲むことをおすすめします

source: ### JSX is an Expression Too {#jsx-is-an-expression-too}
ja: ### JSX もまた式である {#jsx-is-an-expression-too}

source: After compilation, JSX expressions become regular JavaScript function calls and evaluate to JavaScript objects.
ja: コンパイルの後、JSX の式は普通の JavaScript の関数呼び出しに変換され、JavaScript オブジェクトへと評価されます。

source: This means that you can use JSX inside of `if` statements and `for` loops, assign it to variables, accept it as arguments, and return it from functions:
ja: これは JSX を `if` 文や `for` ループの中で使用したり、変数に代入したり、引数として受け取ったり、関数から返したりすることができるということです。

source: ### Specifying Attributes with JSX {#specifying-attributes-with-jsx}
ja: ### JSX で属性を指定する {#specifying-attributes-with-jsx}

source: You may use quotes to specify string literals as attributes:
ja: 文字列リテラルを属性として指定するために引用符を使用できます。

source: You may also use curly braces to embed a JavaScript expression in an attribute:
ja: 属性に JavaScript 式を埋め込むために中括弧を使用することもできます。

source: Don't put quotes around curly braces when embedding a JavaScript expression in an attribute.
ja: 属性に JavaScript 式を埋め込む時に中括弧を囲む引用符を書かないでください。

source: You should either use quotes (for string values) or curly braces (for expressions), but not both in the same attribute.
ja: （文字列の場合は）引用符、もしくは（式の場合は）中括弧のどちらか一方を使用するようにし、同じ属性に対して両方を使用するべきではありません。

source: >**Warning:** > >Since JSX is closer to JavaScript than to HTML, React DOM uses `camelCase` property naming convention instead of HTML attribute names.
ja: >**警告:** > >JSX は HTML よりも JavaScript に近いものですので、React DOM は HTML の属性ではなくキャメルケース (camelCase) のプロパティ命名規則を使用します。

source: > >For example, `class` becomes [`className`](https://developer.mozilla.org/en-US/docs/Web/API/Element/className) in JSX, and `tabindex` becomes [`tabIndex`](https://developer.mozilla.org/en-US/docs/Web/API/HTMLElement/tabIndex).
ja: > >JSX では例えば、`class` は [`className`](https://developer.mozilla.org/en-US/docs/Web/API/Element/className) となり、`tabindex` は [`tabIndex`](https://developer.mozilla.org/en-US/docs/Web/API/HTMLElement/tabIndex) となります。

source: ### Specifying Children with JSX {#specifying-children-with-jsx}
ja: ### JSX で子要素を指定する {#specifying-children-with-jsx}

source: If a tag is empty, you may close it immediately with `/>`, like XML:
ja: タグが空の場合、XML のように `/> `でタグを閉じる事ができます：

source: JSX tags may contain children:
ja: JSX のタグは子要素を持つことができます：

source: ### JSX Prevents Injection Attacks {#jsx-prevents-injection-attacks}
ja: ### JSX はインジェクション攻撃を防ぐ {#jsx-prevents-injection-attacks}

source: It is safe to embed user input in JSX:
ja: JSX にユーザの入力を埋め込むことは安全です：

source: By default, React DOM [escapes](https://stackoverflow.com/questions/7381974/which-characters-need-to-be-escaped-on-html) any values embedded in JSX before rendering them.
ja: デフォルトでは、React DOM は JSX に埋め込まれた値をレンダー前に[エスケープ](https://stackoverflow.com/questions/7381974/which-characters-need-to-be-escaped-on-html)します。

source: Thus it ensures that you can never inject anything that's not explicitly written in your application.
ja: このため、自分のアプリケーションで明示的に書かれたものではないあらゆるコードは、注入できないことが保証されます。

source: Everything is converted to a string before being rendered.
ja: レンダーの前に全てが文字列に変換されます。

source: This helps prevent [XSS (cross-site-scripting)](https://en.wikipedia.org/wiki/Cross-site_scripting) attacks.
ja: これは [XSS (cross-site-scripting)](https://en.wikipedia.org/wiki/Cross-site_scripting) 攻撃の防止に役立ちます。

source: ### JSX Represents Objects {#jsx-represents-objects}
ja: ### JSX はオブジェクトの表現である {#jsx-represents-objects}

source: Babel compiles JSX down to `React.createElement()` calls.
ja: Babel は JSX を `React.createElement()` の呼び出しへとコンパイルします。

source: These two examples are identical:
ja: 以下の 2 つの例は等価です：

source: `React.createElement()` performs a few checks to help you write bug-free code but essentially it creates an object like this:
ja: `React.createElement()` はバグの混入を防止するためにいくつかのチェックも行いますが、本質的には以下のようなオブジェクトを生成します：

source: These objects are called "React elements".
ja: このようなオブジェクトは "React 要素" と呼ばれます。

source: You can think of them as descriptions of what you want to see on the screen.
ja: これらは画面に表示したいものの説明書きとして考えることができます。

source: React reads these objects and uses them to construct the DOM and keep it up to date.
ja: React はこれらのオブジェクトを読み取り、DOM を構築して最新に保ちます。

source: We will explore rendering React elements to the DOM in the [next section](/docs/rendering-elements.html).
ja: [次の章](/docs/rendering-elements.html)では React 要素を DOM に変換することについて見ていきましょう。

source: >**Tip:** > >We recommend using the ["Babel" language definition](https://babeljs.io/docs/en/next/editors) for your editor of choice so that both ES6 and JSX code is properly highlighted.
ja: >**ヒント:** > >利用したいエディタで ["Babel" 言語定義](https://babeljs.io/docs/en/next/editors)を使用して、ES6 と JSX が適切にハイライトされるようにしておくことをお勧めします。
